package LAST1;

public class Sol4 {
    /**
     * 다음 추상 메소드에 대한 설명이다. 다음 문장
     * 중에서 잘못 설명하고 있는 것은 무엇인가?\

     * 가) 추상 메소드는 오버라이딩해야 하므로접근 지정자 private를 사용할 수 없다.
     * 나) 클래스에서 사용되는 추상 메소드의 abstract는 생략될 수 있다.
     * 다) 추상 메소드는 오버라이딩 제한 지정자 final을 사용할 수 없다.
     * 라) 일반 클래스에는 추상 메소드를 선언할수 없다
     *
     *
     나) 클래스에서 사용되는 추상 메소드의 abstract는 생략될 수 있다.' 입니다.
     추상 메소드는 반드시 'abstract' 키워드를 사용하여 선언되어야 하며, 이를 생략할 수 없습니다.
     추상 메소드를 선언하기 위해서는 해당 메소드에 abstract 키워드를 명시해야 합니다.







     */

}
